zephyrproject-rtos/zephyr/drivers/mspi/ospi_stm32.c
/*
 * Copyright (c) 2025 EXALT Technologies
 *
 * SPDX-License-Identifier: Apache-2.0
 */

/*
 * **************************************************************************
 * MSPI flash controller driver for stm32 serie with multi-SPI periherals
 * This driver is based on the stm32Cube HAL OSPI driver
 * with one mspi DTS NODE
 * **************************************************************************
 */
#define DT_DRV_COMPAT st_stm32_ospi_controller

#include <zephyr/drivers/pinctrl.h>
#include <zephyr/drivers/clock_control/stm32_clock_control.h>
#include <zephyr/drivers/clock_control.h>
#include <zephyr/drivers/flash.h>
#include <zephyr/drivers/mspi.h>
#include <zephyr/drivers/dma/dma_stm32.h>
#include <zephyr/drivers/dma.h>
#include <stm32_ll_dma.h>
#include <zephyr/irq.h>
#include <zephyr/logging/log.h>

#define STM32_OSPI_DLYB_BYPASSED DT_PROP(DT_DRV_INST(0), dlyb_bypass)

#define DT_OSPI_IO_PORT_PROP_OR(prop, default_value)					\
	COND_CODE_1(DT_NODE_HAS_PROP(DT_DRV_INST(0), prop),				\
		    (_CONCAT(HAL_OSPIM_, DT_STRING_TOKEN(DT_DRV_INST(0), prop))),	\
		    ((default_value)))

#define DT_OSPI_PROP_OR(prop, default_value) \
	DT_PROP_OR(DT_DRV_INST(0), prop, default_value)

LOG_MODULE_REGISTER(ospi_stm32, CONFIG_MSPI_LOG_LEVEL);

#include "mspi_stm32.h"


static inline int mspi_context_lock(struct mspi_context *ctx, const struct mspi_dev_id *req,
				    const struct mspi_xfer *xfer, bool lockon)
{
	int ret = 0;

	if (k_sem_take(&ctx->lock, K_MSEC(xfer->timeout))) {
		return -EBUSY;
	}
	ctx->xfer = *xfer;
	ctx->packets_left = ctx->xfer.num_packet;

	return ret;
}

/**
 * Check if the MSPI bus is busy.
 *
 * @param controller MSPI emulation controller device.
 * @return true The MSPI bus is busy.
 * @return false The MSPI bus is idle.
 */
static inline bool mspi_is_inp(const struct device *controller)
{
	struct mspi_stm32_data *dev_data = controller->data;

	return (k_sem_count_get(&dev_data->ctx.lock) == 0);
}

static uint32_t mspi_stm32_hal_address_size(uint8_t address_length)
{
	if (address_length == 4U) {
		return HAL_OSPI_ADDRESS_32_BITS;
	}

	return HAL_OSPI_ADDRESS_24_BITS;
}


/*
 * Gives a OSPI_RegularCmdTypeDef with all parameters set
 * except Instruction, Address, NbData
 */
static OSPI_RegularCmdTypeDef mspi_stm32_prepare_cmd(uint8_t cfg_mode, uint8_t cfg_rate)
{
	/* Command empty structure */
	OSPI_RegularCmdTypeDef cmd_tmp = {0};

	cmd_tmp.OperationType = HAL_OSPI_OPTYPE_COMMON_CFG;
	cmd_tmp.InstructionSize = ((cfg_mode == MSPI_IO_MODE_OCTAL) ? HAL_OSPI_INSTRUCTION_16_BITS
								    : HAL_OSPI_INSTRUCTION_8_BITS);
	cmd_tmp.InstructionDtrMode =
		((cfg_rate == MSPI_DATA_RATE_DUAL) ? HAL_OSPI_INSTRUCTION_DTR_ENABLE
						   : HAL_OSPI_INSTRUCTION_DTR_DISABLE);
	cmd_tmp.AlternateBytesMode = HAL_OSPI_ALTERNATE_BYTES_NONE;
	cmd_tmp.AddressDtrMode = ((cfg_rate == MSPI_DATA_RATE_DUAL) ? HAL_OSPI_ADDRESS_DTR_ENABLE
								    : HAL_OSPI_ADDRESS_DTR_DISABLE);
	cmd_tmp.DataDtrMode = ((cfg_rate == MSPI_DATA_RATE_DUAL) ? HAL_OSPI_DATA_DTR_ENABLE
								 : HAL_OSPI_DATA_DTR_DISABLE);
	/* AddressWidth must be set to 32bits for init and mem config phase */
	cmd_tmp.AddressSize = HAL_OSPI_ADDRESS_32_BITS;
	cmd_tmp.DataDtrMode = ((cfg_rate == MSPI_DATA_RATE_DUAL) ? HAL_OSPI_DATA_DTR_ENABLE
								 : HAL_OSPI_DATA_DTR_DISABLE);
	cmd_tmp.DQSMode =
		((cfg_rate == MSPI_DATA_RATE_DUAL) ? HAL_OSPI_DQS_ENABLE : HAL_OSPI_DQS_DISABLE);
	cmd_tmp.SIOOMode = HAL_OSPI_SIOO_INST_EVERY_CMD;

	switch (cfg_mode) {
	case MSPI_IO_MODE_OCTAL: {
		cmd_tmp.InstructionMode = HAL_OSPI_INSTRUCTION_8_LINES;
		cmd_tmp.AddressMode = HAL_OSPI_ADDRESS_8_LINES;
		cmd_tmp.DataMode = HAL_OSPI_DATA_8_LINES;
		break;
	}
	case MSPI_IO_MODE_QUAD: {
		cmd_tmp.InstructionMode = HAL_OSPI_INSTRUCTION_4_LINES;
		cmd_tmp.AddressMode = HAL_OSPI_ADDRESS_4_LINES;
		cmd_tmp.DataMode = HAL_OSPI_DATA_4_LINES;
		break;
	}
	case MSPI_IO_MODE_DUAL: {
		cmd_tmp.InstructionMode = HAL_OSPI_INSTRUCTION_2_LINES;
		cmd_tmp.AddressMode = HAL_OSPI_ADDRESS_2_LINES;
		cmd_tmp.DataMode = HAL_OSPI_DATA_2_LINES;
		break;
	}
	default: {
		cmd_tmp.InstructionMode = HAL_OSPI_INSTRUCTION_1_LINE;
		cmd_tmp.AddressMode = HAL_OSPI_ADDRESS_1_LINE;
		cmd_tmp.DataMode = HAL_OSPI_DATA_1_LINE;
		break;
	}
	}

	return cmd_tmp;
}

static bool mspi_stm32_is_memorymap(const struct device *dev)
{
	struct mspi_stm32_data *dev_data = dev->data;

	return ((READ_BIT(dev_data->hmspi.ospi.Instance->CR,
			  OCTOSPI_CR_FMODE) == OCTOSPI_CR_FMODE) ?
			  true : false);
}

static int mspi_stm32_memmap_off(const struct device *controller)
{
	struct mspi_stm32_data *dev_data = controller->data;

	if (HAL_OSPI_Abort(&dev_data->hmspi.ospi) != HAL_OK) {
		LOG_ERR("MemMapped abort failed");
		return -EIO;
	}
	return 0;
}

/* Set the device in MemMapped mode */
static int mspi_stm32_memmap_on(const struct device *controller)
{
	struct mspi_stm32_data *dev_data = controller->data;
	OSPI_RegularCmdTypeDef s_command =mspi_stm32_prepare_cmd(dev_data->dev_cfg.io_mode, dev_data->dev_cfg.data_rate);
	OSPI_MemoryMappedTypeDef s_MemMappedCfg;
	int ret;

	if (mspi_stm32_is_memorymap(controller)) {
		return 0;
	}
	/* Configure in MemoryMapped mode */
	if ((dev_data->dev_cfg.io_mode == MSPI_IO_MODE_SINGLE) &&

	    (mspi_stm32_hal_address_size(dev_data->dev_cfg.addr_length) ==
	     HAL_OSPI_ADDRESS_24_BITS)) {
		/* OPI mode and 3-bytes address size not supported by memory */
		LOG_ERR("MSPI_IO_MODE_SINGLE in 3Bytes addressing is not supported");
		return -EIO;
	}

	/* Initialize the read command */
	s_command.OperationType = HAL_OSPI_OPTYPE_READ_CFG;
	s_command.InstructionMode = (dev_data->dev_cfg.data_rate == MSPI_DATA_RATE_SINGLE)
					    ? ((dev_data->dev_cfg.io_mode == MSPI_IO_MODE_SINGLE)
						       ? HAL_OSPI_INSTRUCTION_1_LINE
						       : HAL_OSPI_INSTRUCTION_8_LINES)
					    : HAL_OSPI_INSTRUCTION_8_LINES;
	s_command.InstructionDtrMode = (dev_data->dev_cfg.data_rate == MSPI_DATA_RATE_SINGLE)
					       ? HAL_OSPI_INSTRUCTION_DTR_DISABLE
					       : HAL_OSPI_INSTRUCTION_DTR_ENABLE;
	s_command.InstructionSize = (dev_data->dev_cfg.data_rate == MSPI_DATA_RATE_SINGLE)
					    ? ((dev_data->dev_cfg.io_mode == MSPI_IO_MODE_SINGLE)
						       ? HAL_OSPI_INSTRUCTION_8_BITS
						       : HAL_OSPI_INSTRUCTION_16_BITS)
					    : HAL_OSPI_INSTRUCTION_16_BITS;
	s_command.Instruction = (dev_data->dev_cfg.data_rate == MSPI_DATA_RATE_SINGLE)
					? ((dev_data->dev_cfg.io_mode == MSPI_IO_MODE_SINGLE)
						   ? ((mspi_stm32_hal_address_size(
							       dev_data->dev_cfg.addr_length) ==
						       HAL_OSPI_ADDRESS_24_BITS)
							      ? MSPI_STM32_CMD_READ_FAST
							      : MSPI_STM32_CMD_READ_FAST_4B)
						   : dev_data->dev_cfg.read_cmd)
					: MSPI_STM32_OCMD_DTR_RD;
	s_command.AddressMode = (dev_data->dev_cfg.data_rate == MSPI_DATA_RATE_SINGLE)
					? ((dev_data->dev_cfg.io_mode == MSPI_IO_MODE_SINGLE)
						   ? HAL_OSPI_ADDRESS_1_LINE
						   : HAL_OSPI_ADDRESS_8_LINES)
					: HAL_OSPI_ADDRESS_8_LINES;
	s_command.AddressDtrMode = (dev_data->dev_cfg.data_rate == MSPI_DATA_RATE_SINGLE)
					   ? HAL_OSPI_ADDRESS_DTR_DISABLE
					   : HAL_OSPI_ADDRESS_DTR_ENABLE;
	s_command.AddressSize =
		(dev_data->dev_cfg.data_rate == MSPI_DATA_RATE_SINGLE)
			? mspi_stm32_hal_address_size(dev_data->dev_cfg.addr_length)
			: HAL_OSPI_ADDRESS_32_BITS;
	s_command.DataMode = (dev_data->dev_cfg.data_rate == MSPI_DATA_RATE_SINGLE)
				     ? ((dev_data->dev_cfg.io_mode == MSPI_IO_MODE_SINGLE)
						? HAL_OSPI_DATA_1_LINE
						: HAL_OSPI_DATA_8_LINES)
				     : HAL_OSPI_DATA_8_LINES;
	s_command.DataDtrMode = (dev_data->dev_cfg.data_rate == MSPI_DATA_RATE_SINGLE)
					? HAL_OSPI_DATA_DTR_DISABLE
					: HAL_OSPI_DATA_DTR_ENABLE;
	s_command.DummyCycles = dev_data->ctx.xfer.rx_dummy;
	s_command.DQSMode = (dev_data->dev_cfg.data_rate == MSPI_DATA_RATE_SINGLE)
				    ? HAL_OSPI_DQS_DISABLE
				    : HAL_OSPI_DQS_ENABLE;


	ret = HAL_OSPI_Command(&dev_data->hmspi, &s_command, HAL_OSPI_TIMEOUT_DEFAULT_VALUE);
	if (ret != HAL_OK) {
		LOG_ERR("Failed to set memory map %d", dev_data->hmspi.ospi.ErrorCode);
		return -EIO;
	}

	/* Initialize the program command */
	s_command.OperationType = HAL_OSPI_OPTYPE_WRITE_CFG;
	if (dev_data->dev_cfg.data_rate == MSPI_DATA_RATE_SINGLE) {
		s_command.Instruction =
			(dev_data->dev_cfg.io_mode == MSPI_IO_MODE_SINGLE)
				? ((mspi_stm32_hal_address_size(dev_data->ctx.xfer.addr_length) ==
				    HAL_OSPI_ADDRESS_24_BITS)
					   ? MSPI_STM32_CMD_PP
					   : MSPI_STM32_CMD_PP_4B)
				: MSPI_STM32_OCMD_PAGE_PRG;
	} else {
		s_command.Instruction = MSPI_STM32_OCMD_PAGE_PRG;
	}
	s_command.DQSMode = HAL_OSPI_DQS_DISABLE;
	ret = HAL_OSPI_Command(&dev_data->hmspi.ospi, &s_command, HAL_OSPI_TIMEOUT_DEFAULT_VALUE);
	if (ret != HAL_OK) {
		LOG_ERR("Failed to set memory mapped");
		return -EIO;
	}

	/* Enable the memory-mapping */
	s_MemMappedCfg.TimeOutActivation = HAL_OSPI_TIMEOUT_COUNTER_DISABLE;
	ret = HAL_OSPI_MemoryMapped(&dev_data->hmspi.ospi, &s_MemMappedCfg);
	if (ret != HAL_OK) {
		LOG_ERR("Failed to enable memory mapped");
		return -EIO;
	}

	LOG_INF("MEMORY MAPPED MODE ENABLED");

