zephyrproject-rtos/zephyr/drivers/mspi/ospi_stm32.c
	return 0;
}



/* Send a Command to the NOR and Receive/Transceive data if relevant in IT or DMA mode */
static int mspi_stm32_access(const struct device *dev, const struct mspi_xfer_packet *packet,
			     uint8_t access_mode)
{

	struct mspi_stm32_data *dev_data = dev->data;

	HAL_StatusTypeDef hal_ret;

	if (dev_data->xip_cfg.enable) {
		if (mspi_stm32_is_memorymap(dev) && packet->dir == MSPI_TX) {

			hal_ret = mspi_stm32_memmap_off(dev);
			if (hal_ret != 0) {
				LOG_ERR("Failed to abort mempry-mapped before write");
				goto end;
			}
		} else if (packet->dir == MSPI_RX) {
			if (!mspi_stm32_is_memorymap(dev)) {
				hal_ret = mspi_stm32_memmap_on(dev);
				if (hal_ret != 0) {
					LOG_ERR("Failed to set mempry-mapped before read");
					goto end;
				}
			}
			memcpy(packet->data_buf,
			       (uint8_t *)dev_data->memmap_base_addr + packet->address,
			       packet->num_bytes);
			goto end;
		}
	}

	OSPI_RegularCmdTypeDef cmd =
		mspi_stm32_prepare_cmd(dev_data->dev_cfg.io_mode, dev_data->dev_cfg.data_rate);

	cmd.NbData = packet->num_bytes;
	cmd.Instruction = packet->cmd;
	if (packet->dir == MSPI_TX) {
		cmd.DummyCycles = dev_data->ctx.xfer.tx_dummy;
	} else {
		cmd.DummyCycles = dev_data->ctx.xfer.rx_dummy;
	}
	cmd.Address = packet->address; 
	cmd.AddressSize = mspi_stm32_hal_address_size(dev_data->ctx.xfer.addr_length);
	if (cmd.NbData == 0) {
		cmd.DataMode = HAL_OSPI_DATA_NONE;
	}

	if ((cmd.Instruction == MSPI_STM32_CMD_WREN) || (cmd.Instruction == MSPI_STM32_OCMD_WREN)) {
		cmd.AddressMode = HAL_OSPI_ADDRESS_NONE;
	}

	LOG_DBG("MSPI access Instruction 0x%x", cmd.Instruction);

	hal_ret = HAL_OSPI_Command(&dev_data->hmspi.ospi, &cmd, HAL_OSPI_TIMEOUT_DEFAULT_VALUE);
	if (hal_ret != HAL_OK) {
		LOG_ERR("%d: Failed to send OSPI instruction", hal_ret);
		return -EIO;
	}

	if (packet->num_bytes == 0) {
		/* no data to receive : done */
		return 0;
	}

	if (packet->dir == MSPI_RX) {
		/* Receive the data */
		switch (access_mode) {
		case MSPI_ACCESS_SYNC:
			hal_ret = HAL_OSPI_Receive(&dev_data->hmspi.ospi, packet->data_buf,
						   HAL_OSPI_TIMEOUT_DEFAULT_VALUE);
			goto e_access;
		case MSPI_ACCESS_ASYNC:
			hal_ret = HAL_OSPI_Receive_IT(&dev_data->hmspi.ospi, packet->data_buf);
			break;
		case MSPI_ACCESS_DMA:
			hal_ret = HAL_OSPI_Receive_DMA(&dev_data->hmspi.ospi, packet->data_buf);
			break;
		default:
			/* Not correct */
			hal_ret = HAL_BUSY;
			break;
		}
	} else {

		/* Transmit the data */
		switch (access_mode) {
		case MSPI_ACCESS_SYNC:
			hal_ret = HAL_OSPI_Transmit(&dev_data->hmspi.ospi, packet->data_buf,
						    HAL_OSPI_TIMEOUT_DEFAULT_VALUE);
			goto e_access;
		case MSPI_ACCESS_ASYNC:
			hal_ret = HAL_OSPI_Transmit_IT(&dev_data->hmspi.ospi, packet->data_buf);
			break;
		case MSPI_ACCESS_DMA:
			hal_ret = HAL_OSPI_Transmit_DMA(&dev_data->hmspi.ospi, packet->data_buf);
			break;
		default:
			/* Not correct */
			LOG_INF("default");
			hal_ret = HAL_BUSY;
			break;
		}
	}
done:
	if (hal_ret != HAL_OK) {
		LOG_ERR("%d: Failed to access data", hal_ret);
		return -EIO;
	}

	/* Lock again expecting the IRQ for end of Tx or Rx */
	if (k_sem_take(&dev_data->sync, K_FOREVER)) {
		LOG_ERR("%d: Failed to access data", hal_ret);
		return -EIO;
	}

e_access:
	LOG_DBG("Access %zu data at 0x%lx", packet->num_bytes, (long)(packet->address));
end:
	return 0;
}

/* Start Automatic-Polling mode to wait until the memory is setting mask/value bit */
static int mspi_stm32_wait_auto_polling(const struct device *dev, uint8_t match_value,
					uint8_t match_mask, uint32_t timeout_ms)
{
	struct mspi_stm32_data *dev_data = dev->data;
	OSPI_AutoPollingTypeDef s_config;

	/* Set the match to check if the bit is Reset */
	s_config.Match = match_value;
	s_config.Mask = match_mask;

	s_config.MatchMode = HAL_OSPI_MATCH_MODE_AND;
	s_config.Interval = MSPI_STM32_AUTO_POLLING_INTERVAL;
	s_config.AutomaticStop = HAL_OSPI_AUTOMATIC_STOP_ENABLE;

	if (HAL_OSPI_AutoPolling_IT(&dev_data->hmspi.ospi, &s_config) != HAL_OK) {
		LOG_ERR("OSPI AutoPoll failed");
		return -EIO;
	}

	if (k_sem_take(&dev_data->sync, K_MSEC(timeout_ms)) != 0) {
		LOG_ERR("OSPI AutoPoll wait failed");
		HAL_OSPI_Abort(&dev_data->hmspi.ospi);
		k_sem_reset(&dev_data->sync);
		return -EIO;
	}

	/* HAL_OSPI_AutoPolling_IT enables transfer error interrupt which sets
	 * cmd_status.
	 */
	return 0;
}

/*
 * Function to Read the status reg of the device
 * Send the RDSR command (according to io_mode/data_rate
 * Then set the Autopolling mode with match mask/value bit
 * --> Blocking
 */
static int mspi_stm32_status_reg(const struct device *controller, const struct mspi_xfer *xfer)
{
	int ret = 0;
	struct mspi_stm32_data *dev_data = controller->data;

	if (dev_data->xip_cfg.enable) {
		if (mspi_stm32_is_memorymap(controller)) {
			/* Abort Memory mapped mode before write*/
			ret = mspi_stm32_memmap_off(controller);
			if (ret != 0) {
				LOG_ERR("Failed to abort memory mapped mode before write");
				return -1;
			}
		}
	}

	struct mspi_context *ctx = &dev_data->ctx;

	if (xfer->num_packet == 0 || !xfer->packets) {
		LOG_ERR("Status Reg.: wrong parameters");
		return -EFAULT;
	}

	/* Lock with the expected timeout value = ctx->xfer.timeout */
	ret = mspi_context_lock(ctx, dev_data->dev_id, xfer,true);
	/** For async, user must make sure when cfg_flag = 0 the dummy and instr addr length
	 * in mspi_xfer of the two calls are the same if the first one has not finished yet.
	 */
	if (ret) {
		goto status_err;
	}

	OSPI_RegularCmdTypeDef cmd =
		mspi_stm32_prepare_cmd(dev_data->dev_cfg.io_mode, dev_data->dev_cfg.data_rate);
	/* with this command for tstaus Reg, only one packet containing 2 bytes match/mask */
	if(dev_data->dev_cfg.io_mode == MSPI_IO_MODE_OCTAL){
		cmd.Instruction = MSPI_STM32_OCMD_RDSR ;
		cmd.DummyCycles = (dev_data->dev_cfg.data_rate == MSPI_DATA_RATE_DUAL)?
		MSPI_STM32_DUMMY_REG_OCTAL_DTR :MSPI_STM32_DUMMY_REG_OCTAL;
	}else{
		cmd.Instruction = MSPI_STM32_CMD_RDSR;
		cmd.AddressMode = HAL_OSPI_ADDRESS_NONE;
		cmd.DataMode = HAL_OSPI_DATA_1_LINE; /* 1-line DataMode for any non-OSPI transfer */
		/* DummyCycle to give to the mspi_stm32_read_access/mspi_stm32_write_access */
		cmd.DummyCycles = 0;
		cmd.InstructionMode = HAL_OSPI_INSTRUCTION_1_LINE;
	}
	cmd.NbData = (dev_data->dev_cfg.data_rate == MSPI_DATA_RATE_DUAL)? 2U : 1U;
	cmd.Address = 0U;

	LOG_DBG("MSPI poll status reg.");

