zephyrproject-rtos/zephyr/drivers/mspi/ospi_stm32.c
	if (HAL_OSPI_Command(&dev_data->hmspi.ospi, &cmd, HAL_OSPI_TIMEOUT_DEFAULT_VALUE)) {
		LOG_ERR("%d: Failed to send OSPI instruction", ret);
		ret = -EIO;
		goto status_err;
	}

	ret = mspi_stm32_wait_auto_polling(controller,
		MSPI_STM32_MEM_RDY_MATCH,
		MSPI_STM32_MEM_RDY_MASK,
		HAL_OSPI_TIMEOUT_DEFAULT_VALUE);

status_err:
	k_sem_give(&ctx->lock);
	return ret;
}

/*
 * This function Polls the WIP(Write In Progress) bit to become to 0
 * in cfg_mode SPI/OPI MSPI_IO_MODE_SINGLE or MSPI_IO_MODE_OCTAL
 * and cfg_rate transfer STR/DTR MSPI_DATA_RATE_SINGLE or MSPI_DATA_RATE_DUAL
 */
static int mspi_stm32_mem_ready(const struct device *dev, uint8_t cfg_mode, uint8_t cfg_rate)
{
	struct mspi_stm32_data *dev_data = dev->data;

	if(dev_data->xip_cfg.enable){
		if(mspi_stm32_is_memorymap(dev)){
			/* Abort Memory mapped mode before write*/
			int ret = mspi_stm32_memmap_off(dev);
			if(ret != 0){
				LOG_ERR("Failed to abort memory mapped mode before write");
				return -1;
			}
		}
	}

	OSPI_RegularCmdTypeDef s_command = mspi_stm32_prepare_cmd(cfg_mode, cfg_rate);

	/* Configure automatic polling mode command to wait for memory ready */
	if (cfg_mode == MSPI_IO_MODE_OCTAL) {
		s_command.Instruction = MSPI_STM32_OCMD_RDSR;
		s_command.DummyCycles = (cfg_rate == MSPI_DATA_RATE_DUAL)
						? MSPI_STM32_DUMMY_REG_OCTAL_DTR
						: MSPI_STM32_DUMMY_REG_OCTAL;
	} else {
		s_command.Instruction = MSPI_STM32_CMD_RDSR;
		/* force 1-line InstructionMode for any non-OSPI transfer */
		s_command.InstructionMode = HAL_OSPI_INSTRUCTION_1_LINE;
		s_command.AddressMode = HAL_OSPI_ADDRESS_NONE;
		/* force 1-line DataMode for any non-OSPI transfer */
		s_command.DataMode = HAL_OSPI_DATA_1_LINE;
		s_command.DummyCycles = 0;
	}
	s_command.NbData = ((cfg_rate == MSPI_DATA_RATE_DUAL) ? 2U : 1U);
	s_command.Address = 0U;

	if (HAL_OSPI_Command(&dev_data->hmspi.ospi, &s_command, HAL_OSPI_TIMEOUT_DEFAULT_VALUE) !=
	    HAL_OK) {
		LOG_ERR("MSPI AutoPoll command failed");
		return -EIO;
	}
	/* Set the match to 0x00 to check if the WIP bit is Reset */
	LOG_DBG("MSPI read status reg MemRdy");
	return mspi_stm32_wait_auto_polling(dev,
		MSPI_STM32_MEM_RDY_MATCH,
		MSPI_STM32_MEM_RDY_MASK,
		HAL_OSPI_TIMEOUT_DEFAULT_VALUE);
}

/* Enables writing to the memory sending a Write Enable and wait it is effective */
static int mspi_stm32_write_enable(const struct device *dev, uint8_t cfg_mode, uint8_t cfg_rate)
{
	struct mspi_stm32_data *dev_data = dev->data;

	if(dev_data->xip_cfg.enable){
		if(mspi_stm32_is_memorymap(dev)){
			/* Abort Memory mapped mode before write*/
			int ret = mspi_stm32_memmap_off(dev);
			if(ret != 0){
				LOG_ERR("Failed to abort memory mapped mode before write");
				return -1;
			}
		}
	}

	OSPI_RegularCmdTypeDef s_command = mspi_stm32_prepare_cmd(cfg_mode, cfg_rate);
	/* Initialize the write enable command */
	if (cfg_mode == MSPI_IO_MODE_OCTAL) {
		s_command.Instruction = MSPI_STM32_OCMD_WREN;
	} else {
		s_command.Instruction = MSPI_STM32_CMD_WREN;
		/* force 1-line InstructionMode for any non-OSPI transfer */
		s_command.InstructionMode = HAL_OSPI_INSTRUCTION_1_LINE;
	}
	s_command.AddressMode = HAL_OSPI_ADDRESS_NONE;
	s_command.DataMode = HAL_OSPI_DATA_NONE;
	s_command.DummyCycles = 0U;

	if (HAL_OSPI_Command(&dev_data->hmspi.ospi, &s_command, HAL_OSPI_TIMEOUT_DEFAULT_VALUE) !=
	    HAL_OK) {
		LOG_ERR("MSPI flash write enable cmd failed");
		return -EIO;
	}
	LOG_DBG("MSPI write enable");

	/* New command to Configure automatic polling mode to wait for write enabling */
	if (cfg_mode == MSPI_IO_MODE_OCTAL) {
		s_command.Instruction = MSPI_STM32_OCMD_RDSR;
		s_command.AddressMode = HAL_OSPI_ADDRESS_8_LINES;
		s_command.DataMode = HAL_OSPI_DATA_8_LINES;
		s_command.DummyCycles = (cfg_rate == MSPI_DATA_RATE_DUAL)
						? MSPI_STM32_DUMMY_REG_OCTAL_DTR
						: MSPI_STM32_DUMMY_REG_OCTAL;
	} else {
		s_command.Instruction = MSPI_STM32_CMD_RDSR;
		/* force 1-line DataMode for any non-OSPI transfer */
		s_command.InstructionMode = HAL_OSPI_INSTRUCTION_1_LINE;
		s_command.AddressMode = HAL_OSPI_ADDRESS_1_LINE;
		s_command.DataMode = HAL_OSPI_DATA_1_LINE;
		s_command.DummyCycles = 0;

		/* DummyCycles remains 0 */
	}
	s_command.NbData = (cfg_rate == MSPI_DATA_RATE_DUAL) ? 2U : 1U;
	s_command.Address = 0U;

	if (HAL_OSPI_Command(&dev_data->hmspi.ospi, &s_command, HAL_OSPI_TIMEOUT_DEFAULT_VALUE) !=
	    HAL_OK) {
		LOG_ERR("MSPI config auto polling cmd failed");
		return -EIO;
	}
	LOG_DBG("MSPI read status reg");

	return mspi_stm32_wait_auto_polling(dev,
		MSPI_STM32_WREN_MATCH,
		MSPI_STM32_WREN_MASK,
		HAL_OSPI_TIMEOUT_DEFAULT_VALUE);
}

/* Write Flash configuration register 2 with new dummy cycles */
static int mspi_stm32_write_cfg2reg_dummy(const struct device *dev, uint8_t cfg_mode,
					  uint8_t cfg_rate)
{

	int ret =0;
	struct mspi_stm32_data *dev_data = dev->data;

	if (dev_data->xip_cfg.enable) {
		if (mspi_stm32_is_memorymap(dev)) {
			ret = mspi_stm32_memmap_off(dev);
			if (ret != 0) {
				LOG_ERR("Failed to abort mempry-mapped before write");
				goto end_write;
			}
		}
	}

	uint8_t transmit_data = MSPI_STM32_CR2_DUMMY_CYCLES_66MHZ;
	OSPI_RegularCmdTypeDef s_command = mspi_stm32_prepare_cmd(cfg_mode, cfg_rate);

	/* Initialize the writing of configuration register 2 */
	s_command.Instruction = (cfg_mode == MSPI_IO_MODE_SINGLE) ? MSPI_STM32_CMD_WR_CFGREG2
								  : MSPI_STM32_OCMD_WR_CFGREG2;
	s_command.Address = MSPI_STM32_REG2_ADDR3;
	s_command.DummyCycles = 0U;
	s_command.NbData = (cfg_mode == MSPI_IO_MODE_SINGLE)
				   ? 1U
				   : ((cfg_rate == MSPI_DATA_RATE_DUAL) ? 2U : 1U);

	if (HAL_OSPI_Command(&dev_data->hmspi.ospi, &s_command, HAL_OSPI_TIMEOUT_DEFAULT_VALUE) !=
	    HAL_OK) {
		LOG_ERR("MSPI transmit cmd");
		return -EIO;
	}

	if (HAL_OSPI_Transmit(&dev_data->hmspi.ospi, &transmit_data,
			      HAL_OSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK) {
		LOG_ERR("MSPI transmit ");
		return -EIO;
	}
end_write:
	return 0;
}

/* Write Flash configuration register 2 with new single or octal SPI protocol */
static int mspi_stm32_write_cfg2reg_io(const struct device *dev, uint8_t cfg_mode, uint8_t cfg_rate,
				       uint8_t op_enable)
{
	int ret = 0;
	struct mspi_stm32_data *dev_data = dev->data;

