zephyrproject-rtos/zephyr/drivers/mspi/ospi_stm32.c
	LOG_DBG("MSPI Init'd");
#if defined(OCTOSPIM)
	/* OCTOSPI I/O manager init Function */
	OSPIM_CfgTypeDef ospi_mgr_cfg = {0};

	if (dev_data->hmspi.ospi.Instance == OCTOSPI1) {
		ospi_mgr_cfg.ClkPort = DT_OSPI_PROP_OR(clk_port, 1);
		ospi_mgr_cfg.DQSPort = DT_OSPI_PROP_OR(dqs_port, 1);
		ospi_mgr_cfg.NCSPort = DT_OSPI_PROP_OR(ncs_port, 1);
		ospi_mgr_cfg.IOLowPort = DT_OSPI_IO_PORT_PROP_OR(io_low_port,
								 HAL_OSPIM_IOPORT_1_LOW);
		ospi_mgr_cfg.IOHighPort = DT_OSPI_IO_PORT_PROP_OR(io_high_port,
								  HAL_OSPIM_IOPORT_1_HIGH);
	} else if (dev_data->hmspi.ospi.Instance == OCTOSPI2) {
		ospi_mgr_cfg.ClkPort = DT_OSPI_PROP_OR(clk_port, 2);
		ospi_mgr_cfg.DQSPort = DT_OSPI_PROP_OR(dqs_port, 2);
		ospi_mgr_cfg.NCSPort = DT_OSPI_PROP_OR(ncs_port, 2);
		ospi_mgr_cfg.IOLowPort = DT_OSPI_IO_PORT_PROP_OR(io_low_port,
								 HAL_OSPIM_IOPORT_2_LOW);
		ospi_mgr_cfg.IOHighPort = DT_OSPI_IO_PORT_PROP_OR(io_high_port,
								  HAL_OSPIM_IOPORT_2_HIGH);
	}
#if defined(OCTOSPIM_CR_MUXEN)
	ospi_mgr_cfg.Req2AckTime = 1;
#endif /* OCTOSPIM_CR_MUXEN */
	if (HAL_OSPIM_Config(&dev_data->hmspi.ospi, &ospi_mgr_cfg,
		HAL_OSPI_TIMEOUT_DEFAULT_VALUE) != HAL_OK) {
		LOG_ERR("OSPI M config failed");
		return -EIO;
	}
#if defined(CONFIG_SOC_SERIES_STM32U5X)
	/* OCTOSPI2 delay block init Function */
	HAL_OSPI_DLYB_CfgTypeDef ospi_delay_block_cfg = {0};

	ospi_delay_block_cfg.Units = 56;
	ospi_delay_block_cfg.PhaseSel = 2;
	if (HAL_OSPI_DLYB_SetConfig(&dev_data->hmspi.ospi, &ospi_delay_block_cfg) != HAL_OK) {
		LOG_ERR("OSPI DelayBlock failed");
		return -EIO;
	}
#endif /* CONFIG_SOC_SERIES_STM32U5X */

#endif /* OCTOSPIM */

	if (dev_cfg->use_dma) {

		struct dma_config dma_cfg = dev_data->dma.cfg;
		static DMA_HandleTypeDef hdma;

		if (!device_is_ready(dev_data->dma.dev)) {
			LOG_ERR("%s device not ready", dev_data->dma.dev->name);
			return -ENODEV;
		}

		dma_cfg.user_data = &hdma;
		dma_cfg.linked_channel = STM32_DMA_HAL_OVERRIDE;

		ret = dma_config(dev_data->dma.dev, dev_data->dma.channel, &dma_cfg);
		if (ret != 0) {
			LOG_ERR("Failed to configure DMA channel %d", dev_data->dma.channel);
			return ret;
		}

		if (dma_cfg.source_data_size != dma_cfg.dest_data_size) {
			LOG_ERR("Source and Destination data sizes are not aligned");
			return -EINVAL;
		}
		int index = find_lsb_set(dma_cfg.source_data_size) - 1;

#if CONFIG_DMA_STM32U5
		/* Fill the structure for dma init */
		hdma.Init.BlkHWRequest = DMA_BREQ_SINGLE_BURST;
		hdma.Init.SrcInc = DMA_SINC_FIXED;
		hdma.Init.DestInc = DMA_DINC_INCREMENTED;
		hdma.Init.SrcDataWidth = table_src_size[index];
		hdma.Init.DestDataWidth = table_dest_size[index];
		hdma.Init.SrcBurstLength = 4;
		hdma.Init.DestBurstLength = 4;
		hdma.Init.TransferAllocatedPort =
			DMA_SRC_ALLOCATED_PORT0 | DMA_DEST_ALLOCATED_PORT1;
		hdma.Init.TransferEventMode = DMA_TCEM_BLOCK_TRANSFER;
#else
		hdma.Init.PeriphDataAlignment = table_p_size[index];
		hdma.Init.MemDataAlignment = table_m_size[index];
		hdma.Init.PeriphInc = DMA_PINC_DISABLE;
		hdma.Init.MemInc = DMA_MINC_ENABLE;
#endif /* CONFIG_DMA_STM32U5 */

        hdma.Init.Mode = DMA_NORMAL;
		hdma.Init.Priority = table_priority[dma_cfg.channel_priority];
		hdma.Init.Direction = DMA_PERIPH_TO_MEMORY;
		hdma.Instance = STM32_DMA_GET_INSTANCE(dev_data->dma.reg, dev_data->dma.channel);
		hdma.Init.Request = dma_cfg.dma_slot;
		__HAL_LINKDMA(&dev_data->hmspi.ospi, hdma, hdma);
		if(HAL_DMA_Init(&hdma) != HAL_OK){
			LOG_ERR("OSPI DMA Init failed");
			return -EIO;
		}
		LOG_INF("OSPI with DMA Transfer");
	}

	if (!k_sem_count_get(&dev_data->ctx.lock)) {
		// dev_data->ctx.owner = NULL;
		k_sem_give(&dev_data->ctx.lock);
	}

	if (config->re_init) {
		k_mutex_unlock(&dev_data->lock);
	}

	LOG_INF("MSPI config'd");

	return 0;
}

/**
 * Set up a new controller and add its child to the list.
 *
 * @param dev MSPI emulation controller.
 *
 * @retval 0 if successful.
 */
static int mspi_stm32_init(const struct device *controller)
{
	const struct mspi_stm32_conf *cfg = controller->config;
	const struct mspi_dt_spec spec = {
		.bus = controller,
		.config = cfg->mspicfg,
	};

	return mspi_stm32_config(&spec);
}

static struct mspi_driver_api mspi_stm32_driver_api = {
	.config = mspi_stm32_config,
	.dev_config = mspi_stm32_dev_config,
	.xip_config = mspi_stm32_xip_config,
	.get_channel_status = mspi_stm32_get_channel_status,
	.transceive = mspi_stm32_transceive,
};

#define DMA_CHANNEL_CONFIG(node, dir) DT_DMAS_CELL_BY_NAME(node, dir, channel_config)

#define OSPI_DMA_CHANNEL_INIT(node, dir)                                                           \
	.dev = DEVICE_DT_GET(DT_DMAS_CTLR(node)),                                                  \
	.channel = DT_DMAS_CELL_BY_NAME(node, dir, channel),                                       \
	.reg = (DMA_TypeDef *)DT_REG_ADDR(DT_PHANDLE_BY_NAME(node, dmas, dir)),                    \
	.cfg = {                                                                                   \
		.dma_slot = DT_DMAS_CELL_BY_NAME(node, dir, slot),                                 \
		.source_data_size =                                                                \
			STM32_DMA_CONFIG_PERIPHERAL_DATA_SIZE(DMA_CHANNEL_CONFIG(node, dir)),      \
		.dest_data_size =                                                                  \
			STM32_DMA_CONFIG_MEMORY_DATA_SIZE(DMA_CHANNEL_CONFIG(node, dir)),          \
		.channel_priority = STM32_DMA_CONFIG_PRIORITY(DMA_CHANNEL_CONFIG(node, dir)),      \
		.dma_callback = ospi_dma_callback,                                                 \
	},

#define OSPI_DMA_CHANNEL(node, dir)                                                                \
	.dma = {COND_CODE_1(DT_DMAS_HAS_NAME(node, dir),			\
			(OSPI_DMA_CHANNEL_INIT(node, dir)),	    \
			(NULL)) },

/* MSPI control config */
#define MSPI_CONFIG(n)                                                                             \
	{                                                                                          \
		.channel_num = 0,                                                                  \
		.op_mode = DT_ENUM_IDX_OR(n, op_mode, MSPI_OP_MODE_CONTROLLER),                    \
		.duplex = DT_ENUM_IDX_OR(n, duplex, MSPI_HALF_DUPLEX),                             \
		.max_freq = DT_INST_PROP_OR(n, mspi_max_frequency, MSPI_STM32_MAX_FREQ),           \
		.dqs_support = DT_INST_PROP_OR(n, dqs_support, false),                             \
		.num_periph = DT_INST_CHILD_NUM(n),                                                \
		.sw_multi_periph = DT_INST_PROP_OR(n, software_multiperipheral, false),            \
	}

#define STM32_SMPI_IRQ_HANDLER(index)                                                              \
	static void mspi_stm32_irq_config_func_##index(void)                                       \
	{                                                                                          \
		IRQ_CONNECT(DT_INST_IRQN(index), DT_INST_IRQ(index, priority), mspi_stm32_isr,     \
			    DEVICE_DT_INST_GET(index), 0);                                         \
		irq_enable(DT_INST_IRQN(index));                                                   \
	}

#define MSPI_STM32_INIT(index)                                                                        \
	static const struct stm32_pclken pclken_##index[] = STM32_DT_INST_CLOCKS(index);              \
	PINCTRL_DT_INST_DEFINE(index);                                                                \
                                                                                                      \
	static struct gpio_dt_spec ce_gpios##n[] = MSPI_CE_GPIOS_DT_SPEC_INST_GET(n);                 \
	STM32_SMPI_IRQ_HANDLER(index)                                                                 \
	static const struct mspi_stm32_conf mspi_stm32_dev_conf_##index = {                           \
		.pclken = pclken_##index,                                                             \
		.pclk_len = DT_INST_NUM_CLOCKS(index),                                                \
		.irq_config = mspi_stm32_irq_config_func_##index,                                     \
		.mspicfg = MSPI_CONFIG(index),                                                        \
		.pcfg = PINCTRL_DT_DEV_CONFIG_GET(DT_DRV_INST(index)),                                \
		.mspicfg.num_ce_gpios = ARRAY_SIZE(ce_gpios##n),                                      \
		.use_dma = DT_NODE_HAS_PROP(DT_DRV_INST(index), dmas),                                \
	};                                                                                            \
	static struct mspi_stm32_data mspi_stm32_dev_data_##index = {                                 \
		.hmspi.ospi =                                                                         \
			{                                                                             \
				.Instance = (OCTOSPI_TypeDef *)DT_INST_REG_ADDR(index),               \
				.Init =                                                               \
					{                                                             \
						.FifoThreshold = MSPI_STM32_FIFO_THRESHOLD,           \
						.SampleShifting =                                     \
							(DT_INST_PROP(index, ssht_enable)             \
								 ? HAL_OSPI_SAMPLE_SHIFTING_HALFCYCLE \
								 : HAL_OSPI_SAMPLE_SHIFTING_NONE),    \
						.ChipSelectHighTime = 1,                              \
						.ClockMode = HAL_OSPI_CLOCK_MODE_0,                   \
						.ChipSelectBoundary = 0,                              \
						.FreeRunningClock = HAL_OSPI_FREERUNCLK_DISABLE,      \
					},                                                            \
			},                                                                            \
		.memmap_base_addr = DT_REG_ADDR_BY_IDX(DT_DRV_INST(index), 1),                        \
		.dev_id = index,                                                                      \
		.lock = Z_MUTEX_INITIALIZER(mspi_stm32_dev_data_##index.lock),                        \
		.sync = Z_SEM_INITIALIZER(mspi_stm32_dev_data_##index.sync, 0, 1),                    \
		.dev_cfg = {0},                                                                       \
		.xip_cfg = {0},                                                                       \
		.ctx.lock = Z_SEM_INITIALIZER(mspi_stm32_dev_data_##index.ctx.lock, 0, 1),            \
		OSPI_DMA_CHANNEL(DT_DRV_INST(index), tx_rx)};                                         \
                                                                                                      \
	DEVICE_DT_INST_DEFINE(index, &mspi_stm32_init, NULL, &mspi_stm32_dev_data_##index,            \
			      &mspi_stm32_dev_conf_##index, POST_KERNEL,                              \
			      CONFIG_KERNEL_INIT_PRIORITY_DEVICE, &mspi_stm32_driver_api);

DT_INST_FOREACH_STATUS_OKAY(MSPI_STM32_INIT)
